result/azure/001-1.general-vm-general-volume-io.log
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: 0
128 files, 4GiB each
512GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      17.99
    writes/s:                     11.99
    fsyncs/s:                     26.68

Throughput:
    read, MiB/s:                  0.28
    written, MiB/s:               0.19

General statistics:
    total time:                          10.0042s
    total number of events:              567

Latency (ms):
         min:                                  0.02
         avg:                                 17.64
         max:                                363.44
         95th percentile:                     57.87
         sum:                              10001.38

Threads fairness:
    events (avg/stddev):           567.0000/0.00
    execution time (avg/stddev):   10.0014/0.00