result/azure/001-3.general-vm-premium-volume-io.log
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: 0
128 files, 4GiB each
512GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      83.98
    writes/s:                     55.99
    fsyncs/s:                     167.56

Throughput:
    read, MiB/s:                  1.31
    written, MiB/s:               0.87

General statistics:
    total time:                          10.0007s
    total number of events:              3076

Latency (ms):
         min:                                  0.01
         avg:                                  3.25
         max:                                  8.92
         95th percentile:                      6.67
         sum:                               9995.09

Threads fairness:
    events (avg/stddev):           3076.0000/0.00
    execution time (avg/stddev):   9.9951/0.00